Model: "model_2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_7 (InputLayer)            [(None, 30)]         0                                            
__________________________________________________________________________________________________
input_8 (InputLayer)            [(None, 30)]         0                                            
__________________________________________________________________________________________________
embedding_4 (Embedding)         (None, 30, 300)      36150000    input_7[0][0]                    
__________________________________________________________________________________________________
embedding_5 (Embedding)         (None, 30, 300)      36150000    input_8[0][0]                    
__________________________________________________________________________________________________
time_distributed_8 (TimeDistrib (None, 30, 150)      45150       embedding_4[0][0]                
__________________________________________________________________________________________________
time_distributed_9 (TimeDistrib (None, 30, 150)      45150       embedding_5[0][0]                
__________________________________________________________________________________________________
conv1d_16 (Conv1D)              (None, 30, 128)      19328       time_distributed_8[0][0]         
__________________________________________________________________________________________________
conv1d_17 (Conv1D)              (None, 30, 128)      38528       time_distributed_8[0][0]         
__________________________________________________________________________________________________
conv1d_18 (Conv1D)              (None, 30, 128)      57728       time_distributed_8[0][0]         
__________________________________________________________________________________________________
conv1d_19 (Conv1D)              (None, 30, 128)      76928       time_distributed_8[0][0]         
__________________________________________________________________________________________________
conv1d_20 (Conv1D)              (None, 30, 32)       24032       time_distributed_8[0][0]         
__________________________________________________________________________________________________
conv1d_21 (Conv1D)              (None, 30, 32)       28832       time_distributed_8[0][0]         
__________________________________________________________________________________________________
conv1d_22 (Conv1D)              (None, 30, 32)       33632       time_distributed_8[0][0]         
__________________________________________________________________________________________________
conv1d_23 (Conv1D)              (None, 30, 32)       38432       time_distributed_8[0][0]         
__________________________________________________________________________________________________
conv1d_24 (Conv1D)              (None, 30, 128)      19328       time_distributed_9[0][0]         
__________________________________________________________________________________________________
conv1d_25 (Conv1D)              (None, 30, 128)      38528       time_distributed_9[0][0]         
__________________________________________________________________________________________________
conv1d_26 (Conv1D)              (None, 30, 128)      57728       time_distributed_9[0][0]         
__________________________________________________________________________________________________
conv1d_27 (Conv1D)              (None, 30, 128)      76928       time_distributed_9[0][0]         
__________________________________________________________________________________________________
conv1d_28 (Conv1D)              (None, 30, 32)       24032       time_distributed_9[0][0]         
__________________________________________________________________________________________________
conv1d_29 (Conv1D)              (None, 30, 32)       28832       time_distributed_9[0][0]         
__________________________________________________________________________________________________
conv1d_30 (Conv1D)              (None, 30, 32)       33632       time_distributed_9[0][0]         
__________________________________________________________________________________________________
conv1d_31 (Conv1D)              (None, 30, 32)       38432       time_distributed_9[0][0]         
__________________________________________________________________________________________________
global_average_pooling1d_16 (Gl (None, 128)          0           conv1d_16[0][0]                  
__________________________________________________________________________________________________
global_average_pooling1d_17 (Gl (None, 128)          0           conv1d_17[0][0]                  
__________________________________________________________________________________________________
global_average_pooling1d_18 (Gl (None, 128)          0           conv1d_18[0][0]                  
__________________________________________________________________________________________________
global_average_pooling1d_19 (Gl (None, 128)          0           conv1d_19[0][0]                  
__________________________________________________________________________________________________
global_average_pooling1d_20 (Gl (None, 32)           0           conv1d_20[0][0]                  
__________________________________________________________________________________________________
global_average_pooling1d_21 (Gl (None, 32)           0           conv1d_21[0][0]                  
__________________________________________________________________________________________________
global_average_pooling1d_22 (Gl (None, 32)           0           conv1d_22[0][0]                  
__________________________________________________________________________________________________
global_average_pooling1d_23 (Gl (None, 32)           0           conv1d_23[0][0]                  
__________________________________________________________________________________________________
global_average_pooling1d_24 (Gl (None, 128)          0           conv1d_24[0][0]                  
__________________________________________________________________________________________________
global_average_pooling1d_25 (Gl (None, 128)          0           conv1d_25[0][0]                  
__________________________________________________________________________________________________
global_average_pooling1d_26 (Gl (None, 128)          0           conv1d_26[0][0]                  
__________________________________________________________________________________________________
global_average_pooling1d_27 (Gl (None, 128)          0           conv1d_27[0][0]                  
__________________________________________________________________________________________________
global_average_pooling1d_28 (Gl (None, 32)           0           conv1d_28[0][0]                  
__________________________________________________________________________________________________
global_average_pooling1d_29 (Gl (None, 32)           0           conv1d_29[0][0]                  
__________________________________________________________________________________________________
global_average_pooling1d_30 (Gl (None, 32)           0           conv1d_30[0][0]                  
__________________________________________________________________________________________________
global_average_pooling1d_31 (Gl (None, 32)           0           conv1d_31[0][0]                  
__________________________________________________________________________________________________
concatenate_8 (Concatenate)     (None, 640)          0           global_average_pooling1d_16[0][0]
                                                                 global_average_pooling1d_17[0][0]
                                                                 global_average_pooling1d_18[0][0]
                                                                 global_average_pooling1d_19[0][0]
                                                                 global_average_pooling1d_20[0][0]
                                                                 global_average_pooling1d_21[0][0]
                                                                 global_average_pooling1d_22[0][0]
                                                                 global_average_pooling1d_23[0][0]
__________________________________________________________________________________________________
concatenate_9 (Concatenate)     (None, 640)          0           global_average_pooling1d_24[0][0]
                                                                 global_average_pooling1d_25[0][0]
                                                                 global_average_pooling1d_26[0][0]
                                                                 global_average_pooling1d_27[0][0]
                                                                 global_average_pooling1d_28[0][0]
                                                                 global_average_pooling1d_29[0][0]
                                                                 global_average_pooling1d_30[0][0]
                                                                 global_average_pooling1d_31[0][0]
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 640)          0           concatenate_8[0][0]              
                                                                 concatenate_9[0][0]              
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 640)          0           concatenate_8[0][0]              
                                                                 concatenate_9[0][0]              
__________________________________________________________________________________________________
concatenate_10 (Concatenate)    (None, 1280)         0           lambda_2[0][0]                   
                                                                 lambda_3[0][0]                   
__________________________________________________________________________________________________
dropout_14 (Dropout)            (None, 1280)         0           concatenate_10[0][0]             
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 1280)         5120        dropout_14[0][0]                 
__________________________________________________________________________________________________
dense_21 (Dense)                (None, 150)          192150      batch_normalization_9[0][0]      
__________________________________________________________________________________________________
input_9 (InputLayer)            [(None, 90)]         0                                            
__________________________________________________________________________________________________
dropout_15 (Dropout)            (None, 150)          0           dense_21[0][0]                   
__________________________________________________________________________________________________
dense_18 (Dense)                (None, 100)          9100        input_9[0][0]                    
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 150)          600         dropout_15[0][0]                 
__________________________________________________________________________________________________
dropout_13 (Dropout)            (None, 100)          0           dense_18[0][0]                   
__________________________________________________________________________________________________
concatenate_11 (Concatenate)    (None, 250)          0           batch_normalization_10[0][0]     
                                                                 dropout_13[0][0]                 
__________________________________________________________________________________________________
dense_22 (Dense)                (None, 100)          25100       concatenate_11[0][0]             
__________________________________________________________________________________________________
dropout_16 (Dropout)            (None, 100)          0           dense_22[0][0]                   
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 100)          400         dropout_16[0][0]                 
__________________________________________________________________________________________________
dense_23 (Dense)                (None, 10)           1010        batch_normalization_11[0][0]     
__________________________________________________________________________________________________
dropout_17 (Dropout)            (None, 10)           0           dense_23[0][0]                   
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 10)           40          dropout_17[0][0]                 
__________________________________________________________________________________________________
dense_24 (Dense)                (None, 1)            11          batch_normalization_12[0][0]     
==================================================================================================
Total params: 73,258,711
Trainable params: 955,631
Non-trainable params: 72,303,080


Starting training at 2021-05-18 20:01:00.968299
Epoch 1/25
320/320 - 28s - loss: 0.4483 - accuracy: 0.7832 - val_loss: 0.3213 - val_accuracy: 0.8600
Epoch 2/25
320/320 - 22s - loss: 0.3334 - accuracy: 0.8554 - val_loss: 0.2896 - val_accuracy: 0.8693
Epoch 3/25
320/320 - 22s - loss: 0.3072 - accuracy: 0.8640 - val_loss: 0.2754 - val_accuracy: 0.8756
Epoch 4/25
320/320 - 22s - loss: 0.2916 - accuracy: 0.8698 - val_loss: 0.2657 - val_accuracy: 0.8789
Epoch 5/25
320/320 - 22s - loss: 0.2806 - accuracy: 0.8750 - val_loss: 0.2589 - val_accuracy: 0.8813
Epoch 6/25
320/320 - 22s - loss: 0.2695 - accuracy: 0.8801 - val_loss: 0.2524 - val_accuracy: 0.8853
Epoch 7/25
320/320 - 22s - loss: 0.2603 - accuracy: 0.8854 - val_loss: 0.2479 - val_accuracy: 0.8875
Epoch 8/25
320/320 - 22s - loss: 0.2507 - accuracy: 0.8899 - val_loss: 0.2464 - val_accuracy: 0.8872
Epoch 9/25
320/320 - 22s - loss: 0.2413 - accuracy: 0.8949 - val_loss: 0.2455 - val_accuracy: 0.8893
Epoch 10/25
320/320 - 22s - loss: 0.2329 - accuracy: 0.8986 - val_loss: 0.2414 - val_accuracy: 0.8899
Epoch 11/25
320/320 - 22s - loss: 0.2240 - accuracy: 0.9036 - val_loss: 0.2455 - val_accuracy: 0.8892
Epoch 12/25
320/320 - 22s - loss: 0.2146 - accuracy: 0.9082 - val_loss: 0.2415 - val_accuracy: 0.8920
Epoch 13/25
320/320 - 22s - loss: 0.2053 - accuracy: 0.9131 - val_loss: 0.2403 - val_accuracy: 0.8912
Epoch 14/25
320/320 - 22s - loss: 0.1968 - accuracy: 0.9175 - val_loss: 0.2425 - val_accuracy: 0.8920
Epoch 15/25
320/320 - 22s - loss: 0.1882 - accuracy: 0.9222 - val_loss: 0.2481 - val_accuracy: 0.8903
Epoch 16/25
320/320 - 22s - loss: 0.1801 - accuracy: 0.9268 - val_loss: 0.2495 - val_accuracy: 0.8914
Epoch 17/25
320/320 - 22s - loss: 0.1721 - accuracy: 0.9298 - val_loss: 0.2557 - val_accuracy: 0.8908
Epoch 18/25
320/320 - 22s - loss: 0.1638 - accuracy: 0.9345 - val_loss: 0.2573 - val_accuracy: 0.8917
Epoch 19/25
320/320 - 22s - loss: 0.1556 - accuracy: 0.9380 - val_loss: 0.2617 - val_accuracy: 0.8911
Epoch 20/25
320/320 - 22s - loss: 0.1498 - accuracy: 0.9412 - val_loss: 0.2688 - val_accuracy: 0.8916
Epoch 21/25
320/320 - 22s - loss: 0.1425 - accuracy: 0.9443 - val_loss: 0.2741 - val_accuracy: 0.8906
Epoch 22/25
320/320 - 22s - loss: 0.1366 - accuracy: 0.9471 - val_loss: 0.2824 - val_accuracy: 0.8910
Epoch 23/25
320/320 - 22s - loss: 0.1302 - accuracy: 0.9497 - val_loss: 0.2868 - val_accuracy: 0.8892
Epoch 24/25
320/320 - 22s - loss: 0.1244 - accuracy: 0.9528 - val_loss: 0.2864 - val_accuracy: 0.8922
Epoch 25/25
320/320 - 22s - loss: 0.1188 - accuracy: 0.9552 - val_loss: 0.3023 - val_accuracy: 0.8904
Training ended at 2021-05-18 20:10:34.541289
Minutes elapsed: 9.559547

loss = 0.2411, accuracy = 0.8917