Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 30)]         0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 30)]         0                                            
__________________________________________________________________________________________________
embedding (Embedding)           (None, 30, 300)      36150000    input_1[0][0]                    
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 30, 300)      36150000    input_2[0][0]                    
__________________________________________________________________________________________________
time_distributed (TimeDistribut (None, 30, 150)      45150       embedding[0][0]                  
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 30, 150)      45150       embedding_1[0][0]                
__________________________________________________________________________________________________
sequential (Sequential)         (None, 30, 150)      406350      time_distributed[0][0]           
__________________________________________________________________________________________________
sequential_1 (Sequential)       (None, 30, 150)      406350      time_distributed_1[0][0]         
__________________________________________________________________________________________________
attention (Lambda)              (None, 30, 30)       0           sequential[0][0]                 
                                                                 sequential_1[0][0]               
__________________________________________________________________________________________________
permute (Permute)               (None, 30, 30)       0           attention[0][0]                  
__________________________________________________________________________________________________
soft_alignment_a (Lambda)       (None, 30, 150)      0           attention[0][0]                  
                                                                 sequential_1[0][0]               
__________________________________________________________________________________________________
soft_alignment_b (Lambda)       (None, 30, 150)      0           permute[0][0]                    
                                                                 sequential[0][0]                 
__________________________________________________________________________________________________
substract_a (Lambda)            (None, 30, 150)      0           sequential[0][0]                 
                                                                 soft_alignment_a[0][0]           
__________________________________________________________________________________________________
multiply_a (Lambda)             (None, 30, 150)      0           sequential[0][0]                 
                                                                 soft_alignment_a[0][0]           
__________________________________________________________________________________________________
substract_b (Lambda)            (None, 30, 150)      0           sequential_1[0][0]               
                                                                 soft_alignment_b[0][0]           
__________________________________________________________________________________________________
multiply_b (Lambda)             (None, 30, 150)      0           sequential_1[0][0]               
                                                                 soft_alignment_b[0][0]           
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 30, 600)      0           sequential[0][0]                 
                                                                 soft_alignment_a[0][0]           
                                                                 substract_a[0][0]                
                                                                 multiply_a[0][0]                 
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 30, 600)      0           sequential_1[0][0]               
                                                                 soft_alignment_b[0][0]           
                                                                 substract_b[0][0]                
                                                                 multiply_b[0][0]                 
__________________________________________________________________________________________________
sequential_2 (Sequential)       (None, 300)          901200      concatenate[0][0]                
__________________________________________________________________________________________________
sequential_3 (Sequential)       (None, 300)          901200      concatenate_1[0][0]              
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 600)          0           sequential_2[0][0]               
                                                                 sequential_3[0][0]               
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 150)          90150       concatenate_2[0][0]              
__________________________________________________________________________________________________
input_3 (InputLayer)            [(None, 90)]         0                                            
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 150)          0           dense_5[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 100)          9100        input_3[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 150)          600         dropout_3[0][0]                  
__________________________________________________________________________________________________
dropout (Dropout)               (None, 100)          0           dense[0][0]                      
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 250)          0           batch_normalization[0][0]        
                                                                 dropout[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 150)          37650       concatenate_3[0][0]              
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 150)          0           dense_6[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 150)          600         dropout_4[0][0]                  
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 150)          22650       batch_normalization_1[0][0]      
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 150)          0           dense_7[0][0]                    
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 150)          600         dropout_5[0][0]                  
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 100)          15100       batch_normalization_2[0][0]      
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 100)          0           dense_8[0][0]                    
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 100)          400         dropout_6[0][0]                  
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 10)           1010        batch_normalization_3[0][0]      
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 10)           0           dense_9[0][0]                    
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 10)           40          dropout_7[0][0]                  
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 1)            11          batch_normalization_4[0][0]      
==================================================================================================
Total params: 75,183,311
Trainable params: 2,882,191
Non-trainable params: 72,301,120


loss = 0.2355, accuracy = 0.8969